flex.org
#+TITLE: Flex
#+DATE: <2017-10-01>
* Hand Gesture Recognition using Muscle Flexing Sensors           :portfolio:

#+BEGIN_EXPORT html
<iframe
  width="560" height="315"
  src="https://www.youtube.com/embed/gcCZUx5LIl8"
  title="YouTube video player"
  frameborder="0"
  allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share"
  allowfullscreen>
  </iframe>
#+END_EXPORT

- *[[https://dl.acm.org/citation.cfm?id=3134360][ACM Digital Library]]*
- *[[https://github.com/jjsullivan5196/flex][Test data/Driver code]]*

A poster I co-authored demonstrating a novel gesture sensor, built from
an array of bend resistors.

I implemented a recognizer using a Long-Short Term Memory Recurrent
Neural Network, it achieved accuracy surpassing the competing Myo sensor
for the same set of gestures. I also wrote drivers for the sensor itself
using the Arudino toolkit and python serial IO libraries.
