flex.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-02-22 Sat 23:18 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Flex</title>
<meta name="author" content="john" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="./"> UP </a>
 |
 <a accesskey="H" href="/"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">Flex</h1>
<div id="outline-container-org0ab21bf" class="outline-2">
<h2 id="org0ab21bf">Hand Gesture Recognition using Muscle Flexing Sensors</h2>
<div class="outline-text-2" id="text-org0ab21bf">
<iframe
  width="560" height="315"
  src="https://www.youtube.com/embed/gcCZUx5LIl8"
  title="YouTube video player"
  frameborder="0"
  allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share"
  allowfullscreen>
  </iframe>

<ul class="org-ul">
<li><b><a href="https://dl.acm.org/citation.cfm?id=3134360">ACM Digital Library</a></b></li>
<li><b><a href="https://github.com/jjsullivan5196/flex">Test data/Driver code</a></b></li>
</ul>

<p>
A poster I co-authored demonstrating a novel gesture sensor, built from
an array of bend resistors.
</p>

<p>
I implemented a recognizer using a Long-Short Term Memory Recurrent
Neural Network, it achieved accuracy surpassing the competing Myo sensor
for the same set of gestures. I also wrote drivers for the sensor itself
using the Arudino toolkit and python serial IO libraries.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2017-10-01 Sun 00:00</p>
<p class="author">Author: john</p>
<p class="date">Created: 2025-02-22 Sat 23:18</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
